Reports/дог_ГрафикОтгрузкиПокупателям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>дог_ГрафикОтгрузкиПокупателям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/дог_ГрафикОтгрузкиПокупателям/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//получить параметры исполнения отчета
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат общ_ОтчетыВызовСервера.ПолучитьПараметрыИсполненияОтчета();
							
КонецФункции

//получить текст заголовка
//
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт
	
	ЗаголовокОтчета = Метаданные.Отчеты.дог_ГрафикОтгрузкиПокупателям.Синоним;
	Возврат общ_ОтчетыВызовСервера.ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале, ЗаголовокОтчета);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ПараметрыОтчета.СтруктураПараметровОтчетаДляФормирования.ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ПараметрыОтчета.СтруктураПараметровОтчетаДляФормирования.ДоговорКонтрагента,ПараметрыОтчета.СписокСтруктурныхЕдиниц,ПараметрыОтчета.СписокПодразделений);
	 общ_ОтчетыВызовСервера.ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек);
	 
КонецПроцедуры

//после вывода результата
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
 общ_ОтчетыВызовСервера.ПослеВыводаРезультата(ПараметрыОтчета, Результат);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



Процедура ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента,мСписокСтруктурныхЕдиниц,мСписокПодразделений,мДеревоСтруктурныхЕдиниц=Неопределено) Экспорт
	дог_УправлениеДоговорами.УстановитьСписокПодчиненныхДоговоровВКомпоновщикМакета(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента);
	
	//дог_УправлениеДоговорами.УстановитьОтборПоСтруктурнымЕдиницамВКомпоновщикМакета(КомпоновщикНастроек,мСписокСтруктурныхЕдиниц,мСписокПодразделений,мДеревоСтруктурныхЕдиниц);
КонецПроцедуры
